{"keras_version": "1.2.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "W_constraint": null, "subsample": [1, 1], "batch_input_shape": [null, 70, 70, 3], "border_mode": "valid", "W_regularizer": null, "input_dtype": "float32", "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 32, "bias": true, "trainable": true, "b_constraint": null, "nb_col": 3, "activation": "linear", "nb_row": 3, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [2, 2], "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 32, "bias": true, "trainable": true, "b_constraint": null, "nb_col": 3, "activation": "linear", "nb_row": 3, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "strides": [2, 2], "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 64, "bias": true, "trainable": true, "b_constraint": null, "nb_col": 3, "activation": "linear", "nb_row": 3, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "strides": [2, 2], "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "W_constraint": null, "output_dim": 128, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "trainable": true, "b_constraint": null, "input_dim": 3136, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_2", "W_constraint": null, "output_dim": 7, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "trainable": true, "b_constraint": null, "input_dim": 128, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "softmax", "trainable": true}}]}